[
  {
    "questionNumber": 1,
    "tag": "goal",
    "text": "What is your fertility goal?",
    "description": "Select your goal:",
    "subHeading": "",
    "tooltip": "",
    "answerType": "multipleChoice",
    "expectedDataType": "string",
    "choices": [
      {
        "text": "In Vitro Fertilization (IVF)",
        "tooltip": "🤰 In vitro fertilization (IVF) can be a helpful option for couples who are struggling to have a baby through natural conception. It involves stimulating the ovaries of a woman to retrieve egg(s), and then combining the egg with male sperm outside the body in a laboratory dish to create an embryo. This embryo is then implanted in the woman's uterus, in the hope of a successful pregnancy and a healthy baby",
        "tag": "ivf"
      },
      {
        "text": "Embryo Freezing",
        "tooltip": "🧊🧫 Embryo freezing, also known as cryopreservation, is a medical procedure that involves stimulating the ovaries of a woman to retrieve egg(s), and then fertilizing the egg with male sperm outside the body in a laboratory dish to create an embryo. The embryos (early-stage fertilized eggs) are then stored at very low temperatures, typically in liquid nitrogen, to preserve their biologic age. Yes, if you freeze them at age 25 and come back to use them at age 37, the embryo hasn’t aged.",
        "tag": "embryo"
      },
      {
        "text": "Egg Freezing",
        "tooltip": "🧊🥚 Egg freezing, also known as oocyte cryopreservation, is a medical procedure in which a woman stimulates her ovaries (as well as suppresses ovulation) to retrieve egg(s). These eggs are extracted, frozen, and stored for future use. Egg freezing freezes an unfertilized egg (not combined with male sperm), whereas embryo freezing freezes a fertilized egg.",
        "tag": "egg"
      },
      {
        "text": "Elective Egg Freezing (Fertility Preservation)",
        "tooltip": "Elective egg freezing is for the purposes of fertility preservation rather than for the presence of an infertility diagnosis. Reasons for elective egg freezing may include delaying childbearing due to career, educational pursuits, or personal circumstances, preserving fertility before undergoing medical treatments such as chemotherapy or radiation therapy, or the most common reason: you haven’t found the one yet (85% freeze because they can’t find a suitable partner). ",
        "tag": "electiveEgg"
      },
      {
        "text": "I am just here to learn!",
        "tag": "learn"
      }
    ]
  },
  {
    "questionNumber": 2,
    "tag": "familiarity",
    "text": "How familiar are you with the fertility journey?",
    "answerType": "multipleChoice",
    "expectedDataType": "string",
    "choices": [
      {
        "text": "Beginner",
        "tag": "1"
      },
      {
        "text": "Undergoing my first cycle now",
        "tag": "2"
      },
      {
        "text": "Completed 1+ IVF or egg/embryo freezing cycles",
        "tag": "3"
      }
    ]
  },
  {
    "questionNumber": 3,
    "tag": "stage",
    "text": "How far along the fertility journey are you?",
    "answerType": "multipleChoice",
    "expectedDataType": "string",
    "choices": [
      {
        "text": "Starting to research fertility treatments and clinics now",
        "tag": "1"
      },
      {
        "text": "Obtained my fertility lab testing (transvaginal ultrasound and blood test)",
        "tag": "2"
      },
      {
        "text": "Completed my first consultation at a fertility clinic",
        "tag": "3"
      },
      {
        "text": "Deciding to start my first fertility cycle",
        "tag": "4"
      },
      {
        "text": "Purchasing fertility medications and/or hormone injections",
        "tag": "5"
      },
      {
        "text": "Undergoing daily hormone injections and hormone monitoring at my clinic",
        "tag": "6"
      },
      {
        "text": "Completed one cycle of IVF or egg/embryo freezing",
        "tag": "7"
      },
      {
        "text": "Completed 2+ Fertility Cycles",
        "tag": "8"
      }
    ]
  },
  {
    "questionNumber": 4,
    "tag": "age",
    "text": "How old are you?",
    "description": "Enter your age:",
    "subHeading": "🎂 Asking because age is one of the best predictors of egg quality and success rates.",
    "answerType": "freeEntry",
    "expectedDataType": "numeric",
    "minValue": 25,
    "maxValue": 45,
    "note": "Our dataset is only representative of women ages 25 - 45."
  },
  {
    "questionNumber": 5,
    "tag": "diagnosis",
    "text": "What is your primary diagnosis?",
    "description": "Select your primary diagnosis:",
    "subHeading": "Understanding your diagnosis helps tailor your fertility plan.",
    "answerType": "multipleChoice",
    "expectedDataType": "string",
    "choices": [
      {
        "text": "Endometriosis",
        "tooltip": "Endometriosis occurs when the lining of the uterus grows outside it, affecting fertility."
      },
      {
        "text": "Diminished Ovarian Reserve",
        "tooltip": "Fewer eggs in your ovaries than expected for your age can make pregnancy more challenging."
      },
      {
        "text": "Ovulation disorders (including PCOS)",
        "tooltip": "Conditions that affect ovulation, like PCOS, can impact your ability to conceive."
      },
      {
        "text": "Tubal issues",
        "tooltip": "Problems with the fallopian tubes can prevent sperm from reaching the egg."
      },
      {
        "text": "Male Factors (Asthenozoospermia, Azoospermia, Oligoasthenoteratozoospermia)",
        "tooltip": "Male fertility issues can include problems with sperm count, movement, and shape."
      },
      {
        "text": "Uterine factors (including fibroids)",
        "tooltip": "Conditions affecting the uterus, such as fibroids, can impact fertility."
      },
      {
        "text": "Elective fertility treatments",
        "tooltip": "Choosing fertility treatments for reasons other than infertility, such as delaying childbearing."
      },
      {
        "text": "Other diagnosis"
      },
      {
        "text": "Do not know"
      }
    ]
  },
  {
    "questionNumber": 6,
    "tag": "amh",
    "text": "What is your Anti-Müllerian Hormone level?",
    "description": "What is your AMH level (ng/mL):",
    "tooltip": "AMH levels give insights into your ovarian reserve but are not the sole indicator of fertility.",
    "answerType": "freeEntry",
    "expectedDataType": "numeric",
    "defaultValue": 0,
    "minValue": 0,
    "maxValue": 40,
    "note": "Enter a number between 0-40. Leave this question blank if you are unsure."
  },
  {
    "questionNumber": 7,
    "tag": "afc",
    "text": "What is your Antral Follicle Count?",
    "description": "Input your AFC (the number of antral follicles in both ovaries):",
    "tooltip": "An Antral Follicle Count is a transvaginal ultrasound, specifically to count the number of immature follicles available to release an egg each cycle. To get the most accurate results, it is typically done on days 2-3 of the menstrual cycle. In combination with an Anti-Müllerian Hormone test, it can indicate your total remaining egg supply. It does not reveal the quality of the eggs, however.",
    "answerType": "freeEntry",
    "expectedDataType": "numeric",
    "defaultValue": 0,
    "minValue": 0,
    "maxValue": 100,
    "note": "Enter a number between 0-100. Leave this question blank if you are unsure."
  },
  {
    "questionNumber": 8,
    "tag": "location",
    "text": "Last question, are you located in Massachusetts?",
    "subHeading": "Asking so that we can show you relevant resources and providers in your area.",
    "answerType": "multipleChoice",
    "expectedDataType": "string",
    "choices": [
      {
        "text": "Yes"
      },
      {
        "text": "No"
      }
    ]
  }
]
